---
kind: method
id: M:Autodesk.Revit.DB.RelinquishedItems.Dispose
source: html/a14956ec-bd3f-8c74-3766-0a0c6b715550.htm
---
# Autodesk.Revit.DB.RelinquishedItems.Dispose Method

Releases all resources used by the RelinquishedItems

## Syntax (C#)
```csharp
public void Dispose()
```